In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
sns.set()

In [4]:
raw_csv_data = pd.read_csv("IndexE8.csv")
df_complete = raw_csv_data.copy()

**Length of the Time Period**

In [5]:
# Describe the Data column in the Pandas Dataframe
df_complete.date.describe()

count           6269
unique          6269
top       07/01/1994
freq               1
Name: date, dtype: object

**From Text to Date**

In [6]:
'''
This method assumes that we are plugging in a string in a "MM/dd/yyyy" form.
But our data is saved in a "dd/MM/yyyy" format. So we set the argument "dayfirst" to True.
'''
df_complete.date = pd.to_datetime(df_complete.date, dayfirst = True)

In [7]:
df_complete.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [8]:
df_complete.date.describe()

C:\Users\Yago\AppData\Local\Temp\ipykernel_16784\2791965777.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df_complete.date.describe()

count                    6269
unique                   6269
top       1994-01-07 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

**Setting the Index**

In [9]:
df_complete.set_index("date", inplace = True)

In [10]:
df_complete.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

**Setting the Desired Frequency**

In [13]:
'''
    'h' -> Hourly
    'w' -> Weekly
    'd' -> Daily
    'm' -> Monthly
    'a' -> annual

    https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases

    Notice that the line period that are in "NaN" are Sartuday and Sunday.
    So we are using just Business Day Frequency
'''
df_complete = df_complete.asfreq('b')

In [15]:
df_complete.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

**Handling Missing Values**

In [16]:
df_complete.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [19]:
'''
Fillna() filling:
    1. Front Filling -> Assigns the values of the previous period.
    2. Back Filling -> Assigns the value of the next period.
    3. Average Filling -> Assigns the average to all the missing values within the time-series. (This approuch is suitable to values that heavily floatuered
    around the meaning from the first to the last period.
'''
#Front Fill
df_complete.spx = df_complete.spx.fillna(method = 'ffill')
df_complete.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [20]:
#Back Fill
df_complete.ftse = df_complete.ftse.fillna(method = 'bfill')
#Average Fill
df_complete.dax = df_complete.dax.fillna(value = df_complete.dax.mean())

**Simplifying the Dataset**

In [21]:
df_complete['market_value'] = df_complete.spx
df_complete.describe()

               spx           dax         ftse        nikkei  market_value
count  6277.000000   6277.000000  6277.000000   6269.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.055700   1288.642547
std     487.868210   2752.604984  1145.568370   4043.122953    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4070.460000  4487.880000  10709.290000    992.715221
50%    1233.761241   5774.380000  5663.300000  15028.170000   1233.761241
75%    1460.250000   7442.660000  6304.630175  17860.470000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [22]:
del df_complete['spx'], df_complete['dax'], df_complete['ftse'], df_complete['nikkei']
df_complete.describe()

       market_value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

**Splitting the Data**

In [23]:
''' Split in Training Set(80%) and Testing Set(20%) '''
size = int(len(df_complete) * 0.8)
df = df_complete.iloc[:size]
df_test = df_complete.iloc[size:]

In [25]:
df.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [26]:
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623